import React, { useState } from "react";
import { SiCanva } from "react-icons/si";
import axios from "axios";
import Summarise from "../Summarise/Summarise";
import VideoContent from './VideoContent';
import "./Form.css";


function Form() { 
  const [file, setFile] = useState(null);
  const [youtube, setYoutube] = useState('');
  const [source, setSource] = useState("en");
  const [target, setTarget] = useState("hi");
  const [error, setError] = useState(false);
  const [requestError, setRequestError] = useState(false);
  const [videoUrl, setVideoUrl] = useState(null);
  const [targetTxt, setTargetTxt] = useState('');
  const quotes = {  
    ta: ['"சிறப்பாகச் செய்த கடமை அதற்கேற்ற உரிமையை உருவாக்குகிறது."-காந்தி',
'"அரசியலமைப்புச் சட்டம் எவ்வளவு நல்லதாக இருந்தாலும், அதைச் செயல்படுத்துபவர்கள் நல்லவர்களாக இல்லாவிட்டால், அது மோசமானதாகவே நிரூபிக்கப்படும். இருப்பினும், ஒரு அரசியலமைப்பு மோசமானதாக இருக்கலாம், அதை செயல்படுத்துபவர்கள் நல்லவர்களாக இருந்தால், அது நல்லதாக இருக்கும்" - பி.ஆர்.அம்பேத்கர்',
'"நீங்கள் சமூக நீதியை அடையாத வரை, சட்டம் உங்களுக்கு என்ன சுதந்திரம் அளித்தாலும் பலனில்லை" - பி.ஆர்.அம்பேத்கர்',
'"பொதுவான முயற்சியால் நாட்டைப் புதிய மகத்துவத்துக்கு உயர்த்த முடியும், அதே சமயம் ஒற்றுமையின்மை நம்மை புதிய பேரழிவுகளுக்கு ஆளாக்கும்" - சர்தார் வல்லபாய் படேல்',
'"எண்ணம், சொல், செயலில் அகிம்சையைக் கடைப்பிடிக்க வேண்டும். நமது அகிம்சையின் அளவுகோல் நமது வெற்றியின் அளவுகோலாக இருக்கும்" - சர்தார் வல்லபாய் படேல்',
'"ஒரு நபர் ஒரு யோசனைக்காக இறக்கலாம், ஆனால் அந்த யோசனை அவரது மரணத்திற்குப் பிறகு ஆயிரம் உயிர்களில் அவதாரம் எடுக்கும்" - எஸ்சி போஸ்',
'"ஒவ்வொரு தேசத்திற்கும் வழங்க ஒரு செய்தி உள்ளது, நிறைவேற்ற ஒரு பணி, அடைய ஒரு விதி. மனித குலத்திற்கு வழிகாட்டுவதே இந்தியாவின் நோக்கம்" - சுவாமி விவேகானந்தர்',
'"உள்நோக்கத்தின் ஆழமான நேர்மையும், பேச்சில் அதிக தைரியமும், செயலில் அக்கறையும் வேண்டும்" - சரோஜினி நாயுடு',
'"இந்தியாவின் இளம் குடிமகனாக, தொழில்நுட்பம் மற்றும் எனது தேசத்தின் மீதான அன்புடன், நான் உணர்ந்தேன், ஒரு சிறிய நோக்கம் ஒரு குற்றம்" - ஏபிஜே அப்துல் கலாம்',
'"மதரீதியாகச் செய்யப்படும் ஒரு கடமை, அதனுடன் பல முக்கியமான விளைவுகளை ஏற்படுத்துகிறது" - காந்தி',
'"ஒரு மனிதனால் ஒரு உரிமையை விட்டுக்கொடுக்க முடியும், ஆனால் ஒரு பெரிய அவமதிப்புக்குக் குற்றமிழைக்காமல் அவன் கடமையை விட்டுக்கொடுக்க மாட்டான்"-காந்தி',
'"ஒரு தேசத்தின் கலாச்சாரம் அதன் மக்களின் இதயங்களிலும் உள்ளங்களிலும் உள்ளது."-காந்தி'],
    hi: ['अच्छी तरह से निभाया गया कर्तव्य एक समान अधिकार बनाता है।-गांधी',
    'संविधान कितना भी अच्छा क्यों न हो, यदि उसे क्रियान्वित करने वाले अच्छे नहीं हैं तो वह बुरा ही सिद्ध होगा। संविधान कितना भी बुरा क्यों न हो, अगर उसे लागू करने वाले अच्छे हैं तो वह अच्छा साबित होगा- बीआर अंबेडकर',
    'जब तक आप सामाजिक न्याय हासिल नहीं कर लेते, तब तक कानून आपको जो भी स्वतंत्रता प्रदान करता है, उसका कोई फायदा नहीं होगा-बीआर अंबेडकर',
    'सामान्य प्रयास से हम देश को एक नई महानता तक ले जा सकते हैं, जबकि एकता की कमी हमें नई आपदाओं में डाल देगी-सरदार वल्लभभाई पटेल',
    'विचार, वचन और कर्म में अहिंसा का पालन करना होगा। हमारी अहिंसा का माप ही हमारी सफलता का माप होगा-सरदार वल्लभाई पटेल',
    'एक व्यक्ति किसी विचार के लिए मर सकता है लेकिन वह विचार उसकी मृत्यु के बाद हजारों जिंदगियों में अवतरित होगा-एससी बोस',
    'प्रत्येक राष्ट्र के पास देने के लिए एक संदेश है, पूरा करने के लिए एक मिशन है, पहुंचने के लिए एक नियति है। भारत का मिशन मानवता का मार्गदर्शन करना रहा है-स्वामी विवेकानन्द',
    'हम उद्देश्य की गहरी ईमानदारी, वाणी में अधिक साहस और कार्य में ईमानदारी चाहते हैं-सरोजिनी नायडू',
    'भारत के एक युवा नागरिक के रूप में, प्रौद्योगिकी और अपने राष्ट्र के प्रति प्रेम से लैस, मुझे एहसास है, एक छोटा लक्ष्य एक अपराध है- एपीजे अब्दुल कलाम',
    'धार्मिकतापूर्वक किया गया कर्तव्य अपने साथ कई अन्य महत्वपूर्ण परिणाम भी लाता है-गांधी',
    'एक आदमी अपना अधिकार छोड़ सकता है, लेकिन गंभीर अपमान का दोषी हुए बिना वह अपना कर्तव्य नहीं छोड़ सकता-गांधी',
    'किसी राष्ट्र की संस्कृति उसके लोगों के दिलों और आत्माओं में बसती है।-गांधी'],
    mr:['अच्छी तरह से निभाया गया कर्तव्य एक समान अधिकार बनाता है।-गांधी',
    'संविधान कितना भी अच्छा क्यों न हो, यदि उसे क्रियान्वित करने वाले अच्छे नहीं हैं तो वह बुरा ही सिद्ध होगा। संविधान कितना भी बुरा क्यों न हो, अगर उसे लागू करने वाले अच्छे हैं तो वह अच्छा साबित होगा- बीआर अंबेडकर',
    'जब तक आप सामाजिक न्याय हासिल नहीं कर लेते, तब तक कानून आपको जो भी स्वतंत्रता प्रदान करता है, उसका कोई फायदा नहीं होगा-बीआर अंबेडकर',
    'सामान्य प्रयास से हम देश को एक नई महानता तक ले जा सकते हैं, जबकि एकता की कमी हमें नई आपदाओं में डाल देगी-सरदार वल्लभभाई पटेल',
    'विचार, वचन और कर्म में अहिंसा का पालन करना होगा। हमारी अहिंसा का माप ही हमारी सफलता का माप होगा-सरदार वल्लभाई पटेल',
    'एक व्यक्ति किसी विचार के लिए मर सकता है लेकिन वह विचार उसकी मृत्यु के बाद हजारों जिंदगियों में अवतरित होगा-एससी बोस',
    'प्रत्येक राष्ट्र के पास देने के लिए एक संदेश है, पूरा करने के लिए एक मिशन है, पहुंचने के लिए एक नियति है। भारत का मिशन मानवता का मार्गदर्शन करना रहा है-स्वामी विवेकानन्द',
    'हम उद्देश्य की गहरी ईमानदारी, वाणी में अधिक साहस और कार्य में ईमानदारी चाहते हैं-सरोजिनी नायडू',
    'भारत के एक युवा नागरिक के रूप में, प्रौद्योगिकी और अपने राष्ट्र के प्रति प्रेम से लैस, मुझे एहसास है, एक छोटा लक्ष्य एक अपराध है- एपीजे अब्दुल कलाम',
    'धार्मिकतापूर्वक किया गया कर्तव्य अपने साथ कई अन्य महत्वपूर्ण परिणाम भी लाता है-गांधी',
    'एक आदमी अपना अधिकार छोड़ सकता है, लेकिन गंभीर अपमान का दोषी हुए बिना वह अपना कर्तव्य नहीं छोड़ सकता-गांधी',
    'किसी राष्ट्र की संस्कृति उसके लोगों के दिलों और आत्माओं में बसती है।-गांधी'],
    ml:['നന്നായി നിർവഹിക്കുന്ന ഒരു കർത്തവ്യം അതിനനുസൃതമായ അവകാശം സൃഷ്ടിക്കുന്നു.-ഗാന്ധി',
    'ഭരണഘടന എത്ര നല്ലതാണെങ്കിലും അത് നടപ്പിലാക്കുന്നവർ നല്ലവരല്ലെങ്കിൽ അത് മോശമാണെന്ന് തെളിയും. എന്നിരുന്നാലും, ഒരു ഭരണഘടന മോശമായിരിക്കാം, അത് നടപ്പിലാക്കുന്നവർ നല്ലവരാണെങ്കിൽ, അത് നല്ലതാണെന്ന് തെളിയിക്കും - ബി ആർ അംബേദ്കർ',
    'നിങ്ങൾ സാമൂഹ്യനീതി കൈവരിക്കാത്തിടത്തോളം കാലം, നിയമം നിങ്ങൾക്ക് എന്ത് സ്വാതന്ത്ര്യം നൽകിയാലും ഒരു പ്രയോജനവുമില്ല-ബിആർ അംബേദ്കർ',
    'പൊതുവായ പരിശ്രമത്തിലൂടെ നമുക്ക് രാജ്യത്തെ ഒരു പുതിയ മഹത്വത്തിലേക്ക് ഉയർത്താൻ കഴിയും, അതേസമയം ഐക്യമില്ലായ്മ നമ്മെ പുതിയ വിപത്തുകളിലേക്ക് നയിക്കും - സർദാർ വല്ലഭായ് പട്ടേൽ',
    'ചിന്തയിലും വാക്കിലും പ്രവൃത്തിയിലും അഹിംസ പാലിക്കേണ്ടതുണ്ട്. നമ്മുടെ അഹിംസയുടെ അളവുകോലായിരിക്കും നമ്മുടെ വിജയത്തിന്റെ അളവുകോൽ - സർദാർ വല്ലഭായ് പട്ടേൽ',
    'ഒരു വ്യക്തി ഒരു ആശയത്തിന് വേണ്ടി മരിക്കാം, എന്നാൽ ആ ആശയം അവന്റെ മരണശേഷം ആയിരം ജീവിതങ്ങളിൽ അവതരിക്കും-എസ്\u200cസി ബോസ്',
    'ഓരോ രാജ്യത്തിനും കൈമാറാൻ ഒരു സന്ദേശം ഉണ്ട്, നിറവേറ്റാൻ ഒരു ദൗത്യമുണ്ട്, എത്തിച്ചേരാൻ ഒരു വിധിയുണ്ട്. ഇന്ത്യയുടെ ദൗത്യം മാനവികതയെ നയിക്കുക എന്നതാണ് - സ്വാമി വിവേകാനന്ദൻ',
    'പ്രേരണയുടെ ആഴത്തിലുള്ള ആത്മാർത്ഥതയും സംസാരത്തിൽ കൂടുതൽ ധൈര്യവും പ്രവർത്തനത്തിൽ ആത്മാർത്ഥതയും വേണം - സരോജിനി നായിഡു',
    'സാങ്കേതികവിദ്യയും എന്റെ രാഷ്ട്രത്തോടുള്ള സ്നേഹവും കൊണ്ട് സായുധരായ ഇന്ത്യയിലെ ഒരു യുവ പൗരൻ എന്ന നിലയിൽ, ഒരു ചെറിയ ലക്ഷ്യം കുറ്റകൃത്യമാണെന്ന് ഞാൻ മനസ്സിലാക്കുന്നു- എപിജെ അബ്ദുൾ കലാം',
    'മതപരമായി നിർവഹിക്കപ്പെടുന്ന ഒരു കർത്തവ്യം മറ്റു പല സുപ്രധാനമായ അനന്തരഫലങ്ങളും വഹിക്കുന്നു-ഗാന്ധി',
    'ഒരു മനുഷ്യന് ഒരു അവകാശം ഉപേക്ഷിക്കാൻ കഴിയും, എന്നാൽ ഗുരുതരമായ അവഗണനയിൽ കുറ്റക്കാരനല്ലാത്ത ഒരു കടമ ഉപേക്ഷിക്കാൻ കഴിയില്ല-ഗാന്ധി',
    'ഒരു രാഷ്ട്രത്തിന്റെ സംസ്കാരം കുടികൊള്ളുന്നത് അവിടുത്തെ ജനങ്ങളുടെ ഹൃദയത്തിലും ആത്മാവിലുമാണ്.-ഗാന്ധി'],
    te: ['ఒక కర్తవ్యం సక్రమంగా నిర్వర్తిస్తే సంబంధిత హక్కును సృష్టిస్తుంది.-గాంధీ',
    'రాజ్యాంగం ఎంత మంచిదైనా, దానిని అమలు చేస్తున్న వారు మంచివారు కాకపోతే, అది చెడ్డదని రుజువవుతుంది. రాజ్యాంగం చెడ్డది కావచ్చు, దానిని అమలు చేసేవారు మంచివారైతే, అది మంచిదని రుజువు అవుతుంది - బిఆర్ అంబేద్కర్',
    'మీరు సామాజిక న్యాయం సాధించనంత కాలం చట్టం ద్వారా మీకు ఎలాంటి స్వేచ్ఛ కల్పించినా ప్రయోజనం ఉండదు-బీఆర్ అంబేద్కర్',
    'ఉమ్మడి ప్రయత్నం ద్వారా మనం దేశాన్ని కొత్త గొప్పతనానికి తీసుకురాగలం, అయితే ఐక్యత లేకపోవడం వల్ల మనల్ని తాజా విపత్తులకు గురి చేస్తుంది-సర్దార్ వల్లభాయ్ పటేల్',
    'ఆలోచన, మాట, చేతల్లో అహింస పాటించాలి. మన అహింస కొలమానమే మన విజయానికి కొలమానం-సర్దార్ వల్లభాయ్ పటేల్',
    'ఒక వ్యక్తి ఒక ఆలోచన కోసం చనిపోవచ్చు కానీ ఆ ఆలోచన అతని మరణానంతరం వెయ్యి జీవితాల్లో అవతరిస్తుంది-SC బోస్',
    'ప్రతి దేశానికి అందించాల్సిన సందేశం, నెరవేర్చడానికి ఒక లక్ష్యం, చేరుకోవడానికి ఒక విధి ఉంటుంది. మానవాళికి మార్గనిర్దేశం చేయడమే భారతదేశ లక్ష్యం-స్వామి వివేకానంద',
    'మేము ఉద్దేశ్యం యొక్క లోతైన చిత్తశుద్ధి, ప్రసంగంలో గొప్ప ధైర్యం మరియు చర్యలో గంభీరత కావాలి - సరోజినీ నాయుడు',
    'భారతదేశపు యువ పౌరుడిగా, సాంకేతిక పరిజ్ఞానం మరియు నా దేశం పట్ల ప్రేమతో, నేను గ్రహించాను, ఒక చిన్న లక్ష్యం నేరమని- APJ అబ్దుల్ కలాం',
    'మతపరంగా నిర్వహించే విధి అనేక ఇతర ముఖ్యమైన పరిణామాలను కలిగి ఉంటుంది-గాంధీ',
    'ఒక వ్యక్తి హక్కును వదులుకోగలడు, కానీ ఘోరమైన అవమానానికి పాల్పడకుండా విధిని వదులుకోలేడు-గాంధీ',
    'ఒక దేశం యొక్క సంస్కృతి దాని ప్రజల హృదయాలలో మరియు ఆత్మలలో నివసిస్తుంది.-గాంధీ'],
    bn: ['একটি দায়িত্ব ভালভাবে পালন করলে একটি অনুরূপ অধিকার তৈরি হয়।-গান্ধী',
    'সংবিধান যতই ভালো হোক, যারা বাস্তবায়ন করছে তারা ভালো না হলে তা খারাপই প্রমাণিত হবে। যাইহোক, সংবিধান খারাপ হতে পারে, যারা এটি বাস্তবায়ন করছে তারা যদি ভাল হয় তবে এটি ভাল প্রমাণিত হবে - বিআর আম্বেদকর',
    'যতক্ষণ না আপনি সামাজিক ন্যায়বিচার অর্জন না করেন, আইন দ্বারা আপনাকে যা কিছু স্বাধীনতা প্রদান করা হয় তা কোন লাভ হবে না - বিআর আম্বেদকর',
    'সাধারণ প্রচেষ্টার মাধ্যমে আমরা দেশকে একটি নতুন মহত্ত্বের দিকে উন্নীত করতে পারি, যখন ঐক্যের অভাব আমাদের নতুন বিপর্যয়ের মুখোমুখি করবে - সর্দার বল্লভাই প্যাটেল',
    'চিন্তা, কথা ও কাজে অহিংসা পালন করতে হবে। আমাদের অহিংসার মাপকাঠি হবে আমাদের সাফল্যের মাপকাঠি-সর্দার বল্লভাই প্যাটেল',
    'একজন ব্যক্তি একটি ধারণার জন্য মারা যেতে পারে কিন্তু সেই ধারণাটি তার মৃত্যুর পর হাজারো জীবনে অবতীর্ণ হবে-এসসি বোস',
    'প্রতিটি জাতির কাছে পৌঁছে দেওয়ার একটি বার্তা রয়েছে, একটি মিশন পূরণ করার, পৌঁছানোর একটি নিয়তি রয়েছে। ভারতের মিশন ছিল মানবতাকে গাইড করা - স্বামী বিবেকানন্দ',
    'আমরা উদ্দেশ্যের গভীর আন্তরিকতা, বক্তৃতায় আরও সাহস এবং কর্মে আন্তরিকতা চাই-সরোজিনী নাইডু',
    'ভারতের একজন তরুণ নাগরিক হিসাবে, প্রযুক্তিতে সজ্জিত এবং আমার জাতির প্রতি ভালবাসা, আমি বুঝতে পারি, একটি ছোট লক্ষ্য একটি অপরাধ - এপিজে আব্দুল কালাম',
    'ধর্মীয়ভাবে সম্পাদিত একটি দায়িত্ব তার সাথে আরও অনেক গুরুত্বপূর্ণ পরিণতি বহন করে- গান্ধী',
    'একজন মানুষ অধিকার ত্যাগ করতে পারে, কিন্তু গুরুতর অবজ্ঞার অপরাধে সে দায়িত্ব ছেড়ে দিতে পারে না - গান্ধী',
    'একটি জাতির সংস্কৃতি বাস করে মানুষের হৃদয়ে ও আত্মায়।- গান্ধী'],
    gu: ['સારી રીતે નિભાવવામાં આવેલી ફરજ અનુરૂપ અધિકાર બનાવે છે.-ગાંધી',
    'બંધારણ ગમે તેટલું સારું હોય, જો તેનો અમલ કરનારાઓ સારા ન હોય તો તે ખરાબ સાબિત થશે. જો કે, બંધારણ ખરાબ હોઈ શકે છે, જો તેનો અમલ કરનારાઓ સારા હશે તો તે સારું સાબિત થશે - બી.આર. આંબેડકર',
    'જ્યાં સુધી તમે સામાજિક ન્યાય પ્રાપ્ત નહીં કરો ત્યાં સુધી કાયદા દ્વારા તમને જે પણ સ્વતંત્રતા આપવામાં આવશે તેનો કોઈ ફાયદો થશે નહીં - બીઆર આંબેડકર',
    'સામાન્ય પ્રયાસોથી આપણે દેશને એક નવી મહાનતા તરફ ઉંચકી શકીએ છીએ, જ્યારે એકતાનો અભાવ આપણને નવી આફતોનો સામનો કરશે - સરદાર વલ્લભાઈ પટેલ',
    'વિચાર, વચન અને કાર્યમાં અહિંસાનું પાલન કરવું જોઈએ. આપણી અહિંસાનું માપ એ જ આપણી સફળતાનું માપદંડ હશે - સરદાર વલ્લભાઈ પટેલ',
    'એક વ્યક્તિ વિચાર માટે મરી શકે છે પરંતુ તે વિચાર તેના મૃત્યુ પછી હજારો જીવનમાં અવતરશે - એસસી બોઝ',
    'દરેક રાષ્ટ્ર પાસે પહોંચાડવા માટે એક સંદેશ હોય છે, પરિપૂર્ણ કરવા માટે એક મિશન હોય છે, પહોંચવા માટે એક ભાગ્ય હોય છે. ભારતનું મિશન માનવતાને માર્ગદર્શન આપવાનું રહ્યું છે - સ્વામી વિવેકાનંદ',
    'અમે હેતુની ઊંડી પ્રામાણિકતા, વાણીમાં વધુ હિંમત અને કાર્યમાં નિષ્ઠા ઈચ્છીએ છીએ - સરોજિની નાયડુ',
    'ટેક્નોલોજી અને મારા રાષ્ટ્ર પ્રત્યેના પ્રેમથી સજ્જ ભારતના એક યુવાન નાગરિક તરીકે, મને સમજાય છે, એક નાનકડો ધ્યેય ગુનો છે- એપીજે અબ્દુલ કલામ',
    'ધાર્મિક રીતે નિભાવવામાં આવેલ કર્તવ્ય તેની સાથે બીજાં કેટલાંક મહત્ત્વનાં પરિણામો લાવે છે-ગાંધી',
    'માણસ અધિકાર છોડી શકે છે, પરંતુ ગંભીર અવગણનાના દોષિત થયા વિના ફરજ ન છોડી શકે - ગાંધી',
    'રાષ્ટ્રની સંસ્કૃતિ તેના લોકોના હૃદય અને આત્મામાં વસે છે.-ગાંધી'],
    kn: ['ಉತ್ತಮವಾಗಿ ನಿರ್ವಹಿಸಿದ ಕರ್ತವ್ಯವು ಅನುಗುಣವಾದ ಹಕ್ಕನ್ನು ಸೃಷ್ಟಿಸುತ್ತದೆ.-ಗಾಂಧಿ',
    'ಸಂವಿಧಾನ ಎಷ್ಟೇ ಒಳ್ಳೆಯದಾಗಿದ್ದರೂ ಅದನ್ನು ಜಾರಿಗೊಳಿಸುವವರು ಒಳ್ಳೆಯವರಲ್ಲದಿದ್ದರೆ ಅದು ಕೆಟ್ಟದ್ದೆಂದು ಸಾಬೀತಾಗುತ್ತದೆ. ಆದರೆ, ಸಂವಿಧಾನ ಕೆಟ್ಟದಾಗಿರಬಹುದು, ಅದನ್ನು ಜಾರಿಗೊಳಿಸುವವರು ಒಳ್ಳೆಯವರಾಗಿದ್ದರೆ, ಅದು ಒಳ್ಳೆಯದೆಂದು ಸಾಬೀತುಪಡಿಸುತ್ತದೆ - ಬಿಆರ್ ಅಂಬೇಡ್ಕರ್',
    'ಎಲ್ಲಿಯವರೆಗೆ ನೀವು ಸಾಮಾಜಿಕ ನ್ಯಾಯವನ್ನು ಸಾಧಿಸುವುದಿಲ್ಲವೋ ಅಲ್ಲಿಯವರೆಗೆ ಕಾನೂನಿನ ಮೂಲಕ ನಿಮಗೆ ಯಾವ ಸ್ವಾತಂತ್ರ್ಯವನ್ನು ಒದಗಿಸಿದರೂ ಯಾವುದೇ ಪ್ರಯೋಜನವಿಲ್ಲ - ಬಿ.ಆರ್.ಅಂಬೇಡ್ಕರ್',
    'ಸಾಮಾನ್ಯ ಪ್ರಯತ್ನದಿಂದ ನಾವು ದೇಶವನ್ನು ಹೊಸ ಹಿರಿಮೆಗೆ ಏರಿಸಬಹುದು, ಆದರೆ ಏಕತೆಯ ಕೊರತೆ ನಮ್ಮನ್ನು ಹೊಸ ವಿಪತ್ತುಗಳಿಗೆ ಒಡ್ಡುತ್ತದೆ - ಸರ್ದಾರ್ ವಲ್ಲಭಾಯಿ ಪಟೇಲ್',
    'ಅಹಿಂಸೆಯನ್ನು ವಿಚಾರ, ಮಾತು, ಕೃತಿಗಳಲ್ಲಿ ಪಾಲಿಸಬೇಕು. ನಮ್ಮ ಅಹಿಂಸೆಯ ಮಾಪನವೇ ನಮ್ಮ ಯಶಸ್ಸಿನ ಅಳತೆಗೋಲು-ಸರ್ದಾರ್ ವಲ್ಲಭಾಯಿ ಪಟೇಲ್',
    'ಒಬ್ಬ ವ್ಯಕ್ತಿಯು ಒಂದು ಕಲ್ಪನೆಗಾಗಿ ಸಾಯಬಹುದು ಆದರೆ ಆ ಕಲ್ಪನೆಯು ಅವನ ಮರಣದ ನಂತರ ಸಾವಿರ ಜೀವನದಲ್ಲಿ ಅವತರಿಸುತ್ತದೆ - ಎಸ್\u200cಸಿ ಬೋಸ್',
    'ಪ್ರತಿಯೊಂದು ರಾಷ್ಟ್ರವು ತಲುಪಿಸಲು ಸಂದೇಶವನ್ನು ಹೊಂದಿದೆ, ಪೂರೈಸಲು ಒಂದು ಧ್ಯೇಯವನ್ನು ಹೊಂದಿದೆ, ತಲುಪಲು ಒಂದು ಹಣೆಬರಹವನ್ನು ಹೊಂದಿದೆ. ಮಾನವೀಯತೆಗೆ ಮಾರ್ಗದರ್ಶನ ನೀಡುವುದು ಭಾರತದ ಧ್ಯೇಯವಾಗಿದೆ-ಸ್ವಾಮಿ ವಿವೇಕಾನಂದ',
    'ನಾವು ಉದ್ದೇಶದ ಆಳವಾದ ಪ್ರಾಮಾಣಿಕತೆ, ಮಾತಿನಲ್ಲಿ ಹೆಚ್ಚಿನ ಧೈರ್ಯ ಮತ್ತು ಕ್ರಿಯೆಯಲ್ಲಿ ಶ್ರದ್ಧೆಯನ್ನು ಬಯಸುತ್ತೇವೆ - ಸರೋಜಿನಿ ನಾಯ್ಡು',
    'ಭಾರತದ ಯುವ ಪ್ರಜೆಯಾಗಿ, ತಂತ್ರಜ್ಞಾನ ಮತ್ತು ನನ್ನ ರಾಷ್ಟ್ರದ ಮೇಲಿನ ಪ್ರೀತಿಯಿಂದ ಶಸ್ತ್ರಸಜ್ಜಿತನಾಗಿ, ನಾನು ಅರಿತುಕೊಂಡಿದ್ದೇನೆ, ಒಂದು ಸಣ್ಣ ಗುರಿಯು ಅಪರಾಧ - ಎಪಿಜೆ ಅಬ್ದುಲ್ ಕಲಾಂ',
    'ಧಾರ್ಮಿಕವಾಗಿ ನಿರ್ವಹಿಸಿದ ಕರ್ತವ್ಯವು ಹಲವಾರು ಇತರ ಪ್ರಮುಖ ಪರಿಣಾಮಗಳನ್ನು ಹೊಂದಿದೆ-ಗಾಂಧಿ',
    'ಒಬ್ಬ ಮನುಷ್ಯನು ಹಕ್ಕನ್ನು ಬಿಟ್ಟುಕೊಡಬಹುದು, ಆದರೆ ಅವನು ಗಂಭೀರವಾದ ಅವಮಾನದ ತಪ್ಪಿತಸ್ಥನಾಗದೆ ಕರ್ತವ್ಯವನ್ನು ಬಿಟ್ಟುಕೊಡುವುದಿಲ್ಲ-ಗಾಂಧಿ',
    'ಒಂದು ರಾಷ್ಟ್ರದ ಸಂಸ್ಕೃತಿಯು ಅದರ ಜನರ ಹೃದಯದಲ್ಲಿ ಮತ್ತು ಆತ್ಮಗಳಲ್ಲಿ ನೆಲೆಸಿದೆ.-ಗಾಂಧಿ'],
    or:['ଏକ କର୍ତ୍ତବ୍ୟ ଭଲ ଭାବରେ ସଂପୃକ୍ତ ଅଧିକାର ସୃଷ୍ଟି କରେ |',
    'ଯଦିଓ ଏକ ସମ୍ବିଧାନ ଭଲ ହୋଇପାରେ, ଯଦି ଯେଉଁମାନେ ଏହାକୁ କାର୍ଯ୍ୟକାରୀ କରୁଛନ୍ତି ସେମାନେ ଭଲ ନୁହଁନ୍ତି, ଏହା ଖରାପ ବୋଲି ପ୍ରମାଣିତ ହେବ | ତଥାପି, ଏକ ସମ୍ବିଧାନ ଖରାପ ହୋଇପାରେ, ଯଦି ଏହାକୁ କାର୍ଯ୍ୟକାରୀ କରୁଥିବା ଲୋକମାନେ ଭଲ, ତେବେ ଏହା ଭଲ ବୋଲି ପ୍ରମାଣିତ ହେବ- BR ଆମ୍ବେଦକର |',
    'ଯେପର୍ଯ୍ୟନ୍ତ ତୁମେ ସାମାଜିକ ନ୍ୟାୟ ହାସଲ କରୁନାହଁ, ଆଇନ ଅନୁଯାୟୀ ଯାହା ବି ସ୍ୱାଧୀନତା ପ୍ରଦାନ କରାଯାଇଛି ତାହା କ avail ଣସି ଲାଭ ହେବ ନାହିଁ- BR ଆମ୍ବେଦକର |',
    'ସାଧାରଣ ପ୍ରୟାସ ଦ୍ୱାରା ଆମେ ଦେଶକୁ ଏକ ନୂତନ ମହାନତାକୁ ବ raise ାଇ ପାରିବାବେଳେ ଏକତାର ଅଭାବ ଆମକୁ ସତେଜ ବିପଦ-ସର୍ଦ୍ଦାର ଭାଲାଭାଇ ପଟେଲଙ୍କ ନିକଟରେ ପ୍ରକାଶ କରିବ |',
    'ଚିନ୍ତା, ଶବ୍ଦ ଏବଂ କାର୍ଯ୍ୟରେ ଅହିଂସା ପାଳନ କରିବାକୁ ପଡିବ | ଆମର ଅହିଂସା ର ମାପ ଆମର ସଫଳତା-ସର୍ଦ୍ଦାର ଭାଲାଭାଇ ପଟେଲ |',
    'ଜଣେ ବ୍ୟକ୍ତି ଏକ ଧାରଣା ପାଇଁ ମରିପାରନ୍ତି କିନ୍ତୁ ତାଙ୍କ ମୃତ୍ୟୁ ପରେ ସେହି ଧାରଣା ଏକ ହଜାର ଜୀବନରେ ଅବତରଣ କରିବ- ଏସସି ବୋଷ |',
    'ପ୍ରତ୍ୟେକ ରାଷ୍ଟ୍ରର ବିତରଣ କରିବାର ବାର୍ତ୍ତା ଅଛି, ପୂରଣ କରିବାର ଏକ ମିଶନ, ଏକ ଲକ୍ଷ୍ୟ ପହଞ୍ଚିବା | ମାନବିକତା-ସ୍ୱାମୀ ବିବେକାନନ୍ଦଙ୍କୁ ମାର୍ଗଦର୍ଶନ କରିବା ହେଉଛି ଭାରତର ମିଶନ |',
    'ଆମେ ଉଦ୍ଦେଶ୍ୟର ଗଭୀର ଆନ୍ତରିକତା, ବକ୍ତବ୍ୟରେ ଅଧିକ ସାହସ ଏବଂ କାର୍ଯ୍ୟରେ ସରୋଜିନୀ ନାଇଡୁରେ ଆନ୍ତରିକତା ଚାହୁଁ |',
    'ଟେକ୍ନୋଲୋଜି ଏବଂ ମୋ ଦେଶ ପ୍ରତି ଭଲପାଇବା ସହିତ ସଜ୍ଜିତ ଭାରତର ଜଣେ ଯୁବ ନାଗରିକ ଭାବରେ ମୁଁ ଅନୁଭବ କଲି, ଏକ ଛୋଟ ଲକ୍ଷ୍ୟ ହେଉଛି ଅପରାଧ- ଏପିଜେ ଅବଦୁଲ କଲାମ',
    'ଧାର୍ମିକ ଭାବରେ କରାଯାଇଥିବା ଏକ କର୍ତ୍ତବ୍ୟ ଏହା ସହିତ ଅନ୍ୟାନ୍ୟ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପରିଣାମ-ଗାନ୍ଧୀ ବହନ କରେ |',
    'ଜଣେ ବ୍ୟକ୍ତି ଏକ ଅଧିକାର ତ୍ୟାଗ କରିପାରନ୍ତି, କିନ୍ତୁ ସେ ଗୁରୁତର ଅବହେଳା-ଗାନ୍ଧୀରେ ଦୋଷୀ ନ ହୋଇ କ duty ଣସି କର୍ତ୍ତବ୍ୟ ଛାଡି ପାରନ୍ତି ନାହିଁ |',
    'ଏକ ଜାତିର ସଂସ୍କୃତି ହୃଦୟରେ ଏବଂ ଏହାର ଲୋକଙ୍କ ଆତ୍ମାରେ ବାସ କରେ | ଗାନ୍ଧୀ |'],
    pa:['ਇੱਕ ਫ਼ਰਜ਼ ਚੰਗੀ ਤਰ੍ਹਾਂ ਨਿਭਾਇਆ ਜਾਣਾ ਇੱਕ ਅਨੁਸਾਰੀ ਅਧਿਕਾਰ ਬਣਾਉਂਦਾ ਹੈ।-ਗਾਂਧੀ',
    'ਸੰਵਿਧਾਨ ਭਾਵੇਂ ਕਿੰਨਾ ਵੀ ਚੰਗਾ ਕਿਉਂ ਨਾ ਹੋਵੇ, ਜੇਕਰ ਇਸ ਨੂੰ ਲਾਗੂ ਕਰਨ ਵਾਲੇ ਚੰਗੇ ਨਹੀਂ ਹਨ ਤਾਂ ਇਹ ਮਾੜਾ ਹੀ ਸਾਬਤ ਹੋਵੇਗਾ। ਸੰਵਿਧਾਨ ਭਾਵੇਂ ਮਾੜਾ ਹੋਵੇ, ਜੇਕਰ ਇਸ ਨੂੰ ਲਾਗੂ ਕਰਨ ਵਾਲੇ ਚੰਗੇ ਹਨ ਤਾਂ ਇਹ ਚੰਗਾ ਸਾਬਤ ਹੋਵੇਗਾ-ਬੀ.ਆਰ. ਅੰਬੇਡਕਰ',
    'ਜਿੰਨਾ ਚਿਰ ਤੁਸੀਂ ਸਮਾਜਿਕ ਨਿਆਂ ਪ੍ਰਾਪਤ ਨਹੀਂ ਕਰਦੇ, ਕਾਨੂੰਨ ਦੁਆਰਾ ਤੁਹਾਨੂੰ ਜੋ ਵੀ ਆਜ਼ਾਦੀ ਪ੍ਰਦਾਨ ਕੀਤੀ ਜਾਂਦੀ ਹੈ, ਉਸ ਦਾ ਕੋਈ ਲਾਭ ਨਹੀਂ ਹੋਵੇਗਾ - ਬੀ.ਆਰ. ਅੰਬੇਡਕਰ',
    'ਸਾਂਝੇ ਯਤਨਾਂ ਨਾਲ ਅਸੀਂ ਦੇਸ਼ ਨੂੰ ਨਵੀਂ ਮਹਾਨਤਾ ਵੱਲ ਉਭਾਰ ਸਕਦੇ ਹਾਂ, ਜਦੋਂ ਕਿ ਏਕਤਾ ਦੀ ਘਾਟ ਸਾਨੂੰ ਤਾਜ਼ਾ ਬਿਪਤਾਵਾਂ ਦੇ ਸਾਹਮਣੇ ਲਿਆਵੇਗੀ-ਸਰਦਾਰ ਵੱਲਭਭਾਈ ਪਟੇਲ',
    'ਅਹਿੰਸਾ ਨੂੰ ਵਿਚਾਰ, ਬਚਨ ਅਤੇ ਕਰਮ ਵਿੱਚ ਰੱਖਣਾ ਚਾਹੀਦਾ ਹੈ। ਸਾਡੀ ਅਹਿੰਸਾ ਦਾ ਪੈਮਾਨਾ ਹੀ ਸਾਡੀ ਸਫਲਤਾ ਦਾ ਪੈਮਾਨਾ ਹੋਵੇਗਾ-ਸਰਦਾਰ ਵੱਲਭਭਾਈ ਪਟੇਲ',
    'ਇੱਕ ਵਿਅਕਤੀ ਇੱਕ ਵਿਚਾਰ ਲਈ ਮਰ ਸਕਦਾ ਹੈ ਪਰ ਇਹ ਵਿਚਾਰ ਉਸਦੀ ਮੌਤ ਤੋਂ ਬਾਅਦ ਹਜ਼ਾਰਾਂ ਜੀਵਨਾਂ ਵਿੱਚ ਅਵਤਾਰ ਹੋਵੇਗਾ - ਐਸਸੀ ਬੋਸ',
    'ਹਰ ਕੌਮ ਕੋਲ ਪਹੁੰਚਾਉਣ ਲਈ ਇੱਕ ਸੰਦੇਸ਼ ਹੈ, ਇੱਕ ਮਿਸ਼ਨ ਨੂੰ ਪੂਰਾ ਕਰਨਾ ਹੈ, ਪਹੁੰਚਣ ਲਈ ਇੱਕ ਕਿਸਮਤ ਹੈ। ਭਾਰਤ ਦਾ ਮਿਸ਼ਨ ਮਨੁੱਖਤਾ ਦਾ ਮਾਰਗਦਰਸ਼ਨ ਕਰਨਾ ਰਿਹਾ ਹੈ-ਸਵਾਮੀ ਵਿਵੇਕਾਨੰਦ',
    'ਅਸੀਂ ਇਰਾਦੇ ਦੀ ਡੂੰਘੀ ਇਮਾਨਦਾਰੀ, ਬੋਲਣ ਵਿੱਚ ਵਧੇਰੇ ਹਿੰਮਤ ਅਤੇ ਕਾਰਵਾਈ ਵਿੱਚ ਗੰਭੀਰਤਾ ਚਾਹੁੰਦੇ ਹਾਂ-ਸਰੋਜਨੀ ਨਾਇਡੂ',
    'ਭਾਰਤ ਦੇ ਇੱਕ ਨੌਜਵਾਨ ਨਾਗਰਿਕ ਹੋਣ ਦੇ ਨਾਤੇ, ਤਕਨਾਲੋਜੀ ਅਤੇ ਆਪਣੇ ਦੇਸ਼ ਲਈ ਪਿਆਰ ਨਾਲ ਲੈਸ, ਮੈਨੂੰ ਅਹਿਸਾਸ ਹੁੰਦਾ ਹੈ, ਇੱਕ ਛੋਟਾ ਉਦੇਸ਼ ਇੱਕ ਅਪਰਾਧ ਹੈ - ਏਪੀਜੇ ਅਬਦੁਲ ਕਲਾਮ',
    "ਧਾਰਮਿਕ ਤੌਰ 'ਤੇ ਨਿਭਾਇਆ ਗਿਆ ਫ਼ਰਜ਼ ਇਸ ਦੇ ਨਾਲ ਕਈ ਹੋਰ ਮਹੱਤਵਪੂਰਨ ਨਤੀਜੇ ਵੀ ਲਿਆਉਂਦਾ ਹੈ-ਗਾਂਧੀ",
    'ਆਦਮੀ ਆਪਣਾ ਹੱਕ ਛੱਡ ਸਕਦਾ ਹੈ, ਪਰ ਉਹ ਕਿਸੇ ਗੰਭੀਰ ਅਣਗਹਿਲੀ ਦਾ ਦੋਸ਼ੀ ਹੋਏ ਬਿਨਾਂ ਫ਼ਰਜ਼ ਨਹੀਂ ਛੱਡ ਸਕਦਾ-ਗਾਂਧੀ',
    'ਕਿਸੇ ਰਾਸ਼ਟਰ ਦੀ ਸੰਸਕ੍ਰਿਤੀ ਉਸ ਦੇ ਲੋਕਾਂ ਦੇ ਦਿਲਾਂ ਅਤੇ ਰੂਹਾਂ ਵਿੱਚ ਵਸਦੀ ਹੈ।-ਗਾਂਧੀ']
    // Add quotes for other languages as needed
  };
  const [currentQuoteIndex, setCurrentQuoteIndex] = useState(0);  const [showSummarise, setShowSummarise] = useState(false);

  const handleFileChange = (e) => {
    setFile(e.target.files[0]);
  };
  const handleYoutubeChange = (e) => {
    setYoutube(e.target.value);
  };
  const handleSourceChange = (e) => {
    setSource(e.target.value);
  };
  const handleTargetChange = (e) => {
    setTarget(e.target.value);
  };
  const handleDeleteClick = () => {
    setVideoUrl(null);
  };
   
  const updateQuote = () => {
    if (quotes[target]) {
      setCurrentQuoteIndex((prevIndex) => {
        // Ensure the index wraps around when reaching the end of the quotes array
        return (prevIndex + 1) % quotes[target].length;
      });
    }
  };
  
  const handleSubmit = async (e) => {
    e.preventDefault();  setVideoUrl(null);


    setRequestError(false);           //
    if (!file && !youtube) {
      setError(true);
      return;
    }
    document.querySelector(".spinnerCont").classList.add("show");
    document.querySelector(".wrapper").classList.add("hide");
    const intervalId = setInterval(updateQuote, 15000);
    const youtubeURL = youtube;

    const formData = new FormData();
    formData.append("mp4File", file);
    formData.append("source", source);
    formData.append("target", target);


    try {
      let response ;
      if(file) 
     { 
      response = await axios.post("http://localhost:3000/upload", formData, {
        responseType: "arraybuffer",
      });
    }
      else{
        response = await axios.post("http://localhost:3000/youtubeUpload", {youtubeURL, source, target}, {
          responseType: "arraybuffer",
        });
      }
      const sourceText = response;
      console.log("Source text:", sourceText);
      document.querySelector(".spinnerCont").classList.remove("show");
      document.querySelector(".wrapper").classList.remove("hide");
      if (response.status === 200) {
        setTargetTxt(response.headers["content-type"])
        if(response.headers["content-type"]=='video/mp3') 
        setRequestError(true);
        const videoBlob = new Blob([response.data], { type: "video/mp4" });
        const url = URL.createObjectURL(videoBlob);
        // Set the video URL
        setVideoUrl(url);
        
      } else {
        // Handle errors here
        setRequestError(true);
        console.error("Request failed with status:", response.status);
      }
    } catch (error) {
      document.querySelector(".spinnerCont").classList.remove("show");
      document.querySelector(".wrapper").classList.remove("hide");
      setRequestError(true);
      console.error("An error occurred:", error);
    }
  };

  const handleSum = (e) => {
  e.preventDefault();
  setShowSummarise(true);
};
const handleBack = (e) => {
  e.preventDefault();
  setShowSummarise(false);
}
return (
    <div className="form-comp">
      <div className="spinnerCont">
        <h2>Processing Your Video!</h2>
      <div className="spinner"></div> {quotes[target] && (
        <span className="spanChange">{quotes[target][currentQuoteIndex].split("-")[0]}-<b>{quotes[target][currentQuoteIndex].split("-")[1]}</b></span>
      )}
     </div>
      <div className="wrapper">
        <div className="sum">
        <h2>Try it yourself!</h2>
          {!showSummarise ? (
          <button className="choose-btn" onClick={handleSum}>
            Summarise
          </button>
        ) : null}
      </div>
          <form className="card form" onSubmit={handleSubmit}>
              <div className="top">
                <div className="file">
                  <label htmlFor="">Upload video</label>
                  <input type="file" name="" id="" accept='video/mp4'  onChange={handleFileChange} />
                  <span style={{ marginLeft:'150px',marginBottom:'10px' }}>OR</span>
                  <label htmlFor="">Upload Youtube URL</label>
                  <input type="text" name="" id="" accept='video/mp4'  onChange={handleYoutubeChange} />
                  {error && (
                    <p style={{ color: "red" }} className="errorTxt">
                      Please upload a file
                    </p>
                  )}
                  {requestError && (
                    <p style={{ color: "red" }} className="errorTxt">
                      Error Processing Video
                    </p>
                  )}
            </div>
              </div>
                  <div className="bottom">
                <div className="label-el">
                  <label htmlFor="">Source Language</label>
                  <select name="" id="" onChange={handleSourceChange}>
                    <option value="enEnglish">English</option>
                  </select>
                </div>

            <div className="label-el">
              <label htmlFor="">Target Language</label>
              <select name="" id="" onChange={handleTargetChange}>
                <option value="hi">Hindi</option>
                <option value="ta">Tamil</option>
                <option value="ml">Malayalam</option>
                <option value="mr">Marathi</option>
                <option value="te">Telugu</option>
                <option value="bn">Bengali</option>
                <option value="gu">Gujarati</option>
                <option value="kn">Kannada</option>
                <option value="pa">Punjabi</option>
                <option value="or">Odia</option>
              </select>
            </div>
            <button type="submit" onClick={handleSubmit}>
              Submit
            </button>
          </div>
        </form>
      </div>
      {videoUrl && (
          <VideoContent videoUrl={videoUrl} handleDeleteClick={handleDeleteClick} targetTxt={targetTxt}></VideoContent>
      )}
      <div className="how-it-works">
        <h2 style={{ fontWeight: "800" }}>How it works!</h2>
        <div className="card-small">
          <p style={{ position: "absolute", top: "1px" }}>
            {" "}
            Curious about how it works?
          </p>
          <p className="desc">
            DubStudioX leverages cutting-edge Machine Learning models to convert spoken content into precise,
            professionally processed text. Our technology ensures seamless,
            accurate transcription, eliminating manual effort and enhancing
            efficiency.
          </p>
          <p className="read-more">
            Want to know more?{" "}
            <a
              href="https://www.canva.com/design/DAFvP_FYJS4/yDBLNvXK_izuWosuXTXeDw/edit"
              target="__blank"
              className="canva"
            >
              <SiCanva
                size={30}
                style={{ marginRight: "5px", marginLeft: "10px" }}
              />
              Click here
            </a>
          </p>
        </div>
      </div>
      </div>
)
      }
export default Form;
